;------------------------------------------------------------------------------
; UltraDefrag GUI Finnish Language Pack.
; Copyright (C) 2010 by Stefan Pendl.
;------------------------------------------------------------------------------
; History --- Date ---------- Full Name
;------------------------------------------------------------------------------
; Revised Feb. 15, 2010 by jtl
; Revised Mar. 31, 2010 by jtl
;------------------------------------------------------------------------------

; Please keep the header and comments in English and use Latin letters,
; so everyone understands them

; THIS FILE MUST BE SAVED IN UNICODE (UTF-16) ENCODING
; Use \n as a newline character in strings.


; Main window controls.

RESCAN_DRIVES         = Skannaa uudelleen
SKIP_REMOVABLE_MEDIA  = Ohita siirrettävät asemat
CLUSTER_MAP           = Klusterikartta
ANALYSE               = Analysoi
DEFRAGMENT            = Eheytä
OPTIMIZE              = Optimoi
PAUSE                 = Tauko
STOP                  = Lopeta
REPORT                = Raportti
SETTINGS              = Asetukset
ABOUT                 = Ohjelmasta
SHUTDOWN_PC_AFTER_A_JOB  = Sammuta PC työn valmistuttua
HIBERNATE_PC_AFTER_A_JOB = PC horrostilaan työn valmistuttua

; Drives list items.

VOLUME                = Asema
STATUS                = Tilanne
FILESYSTEM            = Tiedostojärjestelmä
TOTAL                 = Koko
FREE                  = Vapaana
PERCENT               = Osuus

; Status messages

STATUS_RUNNING        = Käynnissä
STATUS_ANALYSED       = Analysoitu
STATUS_DEFRAGMENTED   = Eheytetty
STATUS_OPTIMIZED      = Optimoitu

; Status bar messages.

DIRS                  = kansiota
FILES                 = tiedostoa
FRAGMENTED            = pirstoutunutta
COMPRESSED            = pakattua
MFT                   = MFT

; About window.

ABOUT_WIN_TITLE       = Tietoja Ultra Defragmenterista
CREDITS               = Kiitokset
LICENSE               = Lisenssi

; Shutdown confirmation

PLEASE_CONFIRM             = Vahvista
REALLY_SHUTDOWN_WHEN_DONE  = Haluatko sammuttaa koneen tehtävän päätteeksi?
REALLY_HIBERNATE_WHEN_DONE = Haluatko koneen horrostilaan tehtävän päätteeksi?
SECONDS_TILL_SHUTDOWN      = sekuntia koneen sammutukseen
SECONDS_TILL_HIBERNATION   = sekuntia horrostilaan siirtymiseen
YES                        = Kyllä
NO                         = Ei

; END OF FILE
